---
kind: property
id: P:Autodesk.Revit.DB.ColorFillScheme.Title
source: html/4a9768ad-6b47-5ac4-b4c3-b67717268fee.htm
---
# Autodesk.Revit.DB.ColorFillScheme.Title Property

Represents the title displayed in ColorFillLegend .

## Syntax (C#)
```csharp
public string Title { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - When setting this property: A non-optional argument was null